roam/20260506180859-stringa.tex
% Created 2026-05-11 Mon 12:30
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}

\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{ok}
\usepackage{minted}
\usepackage{babel}[italian]
\author{flavio}
\date{\today}
\title{Stringhe}
\hypersetup{
 pdfauthor={flavio},
 pdftitle={Stringhe},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={},
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Le stringhe}
\label{sec:orgd8fd39c}
in java nonostante le apparenze le stringhe non sono un tipo primitivo, ma sono importate dal package java.lang perché l'operatore + viene ridefinito. Inoltre dato che non un tipo primitivo non possiamo utilizzare i normali operatori che abbiamo utilizzato per accedere
\subsection{ottenere la lunghezza}
\label{sec:orga9e6972}

La classe String è dotata del metodo \texttt{length()} ad esempio:
String s = ``Ciao''
System.out.println(s.length()) stamperà 4
\subsection{conversione a maiscuolo e minuscolo}
\label{sec:org736289b}
le stringhe hanno i metodi \texttt{toLowerCase()} e \texttt{toUpperCase()} che ritornano rispettivamente delle nuove stringhe in minuscolo o maiuscolo.
\begin{minted}[]{java}
String min = "Ciao".toLowerCase(); // “ciao”
String max = "Ciao".toUpperCase(); // “CIAO[[id:74295e9a-da30-42fe-bb04-de5e6d5a4166][heap_stack_metaspace]]n”
String ariMin = max.toLowerCase(); // “ciao”
System.out.println("Ciao");
\end{minted}
\subsection{ottenere i singoli caratteri}
\label{sec:orgd305629}
per questo esiste il metodo charAt. Il primo carattere in posizione 0; l'ultimo carattere in posizione stringa.length()-1
\textbf{importante}
questo metodo ritorna molto utile per iterare sulla stringa carattere per carattere.
for(int i = 0; i < s.length();i++)
\{
System.out.println(s.charAt(i));
\}
\subsection{creazione una sottostringa}
\label{sec:org8bf8e38}
con il metodo s.substring(startIndex,endIndex). startIndex e endIndex devono essere compresi tra 0 e s.length()-1
\begin{itemize}
\item startindex: indice di partenza
\begin{itemize}
\item endIndex: indice di fine
\end{itemize}
\end{itemize}
\subsection{Concatenazione}
\label{sec:org87e3490}
Si possono concatenare 2 stringhe:
\begin{minted}[]{java}
String s3 = s1+s2
String s4= s1.concat(s2)
\end{minted}

\textbf{StringBuilder}
ma se si vogliono concatenare più stringhe si usa la classe \texttt{Stringbuilder} che ha i metodi \texttt{append} (concatena la stringa) e insert(int posizione, String s), dopo che le operazioni sulle stringhe sono state completate per ottenere la stringa si chiama il metodo toString() dell'istanza dello stringBuilder
StringBuilder sb = new StringBuilder()
sb.append(s1)
\subsection{Ricerca in una stringa}
\label{sec:org7f5018c}
Si può cercare la prima posizione di un carattere c con : restituisce -1 se il carattere, si applica alle stringhe dove ritorna l'indice del primo carattere della stringa cercata.
s1.indexof(c)
\subsection{Sostituire caratteri e stringhe}
\label{sec:org9bf6234}
Con il metodo replace è possibile sostituire tutti le occorrenze di un carattere o di una stringa con un'altra stringa.
\subsection{dividere le stringhe}
\label{sec:orgc46dbec}
\begin{minted}[]{java}
String[] s1 = "uno due tre".split(" ");
for(int i = 0; i < s1.length; i++)
System.out.println(s1[i]);
\end{minted}

Una stringa può essere divisa in più stringhe grazie al metodo split se passiamo un'espressione regolare s e restituisce un array di sottostringhe separate da s.
\section{Confronto tra oggetti}
\label{sec:org232951e}
Tutti gli oggetti incluse le stringhe vanno confrontate con il metodo equals.
\subsection{differenza tra equals e \texttt{==}}
\label{sec:org7592679}
L'operatore == in caso di oggetti confronta il riferimento cioè l'indirizzo in memoria. Quindi è vero solo se si confrontano se puntano alla stessa cosa.
Il metodo equals confronta la stringa carattere per carattere e restituisce \texttt{true} se le stringhe contengono la stessa sequenza di caratteri
\begin{minted}[]{java}
String s1 = "ciao";
String s2 = "ci"+"ao";
String s3 = "hello";
System.out.println(s1 == s2); //falso
System.out.println(s1.equals(s2)); // vero
System.out.println(s1.equals(s3)); // falso
\end{minted}
\end{document}
